[
  {
    "id": 1,
    "title": "OC Booki",
    "image": "/Assets/Booki.png",
    "shortDescription": "Le projet Booki consiste à développer un site web permettant aux utilisateurs de rechercher des hébergements et des activités.",
    "fullDescription": " En tant que développeur web débutant votre alternance chez la start-up Booki, vous participez à la réalisation d'un site web qui permet aux utilisateurs de rechercher facilement des hébergements et des activités touristiques dans la ville de leur choix. Votre rôle est d'intégrer l'interface utilisateur en utilisant HTML et CSS, sous la direction de Sarah, la CTO, et en collaboration avec Loïc, l'UI designer. Vous disposez des maquettes complètes pour desktop, tablette et mobile, ainsi que d'une structure de fichiers initiale comprenant une base de code HTML, CSS et un ensemble d'images. Votre tâche consiste à compléter cette base tout en respectant les spécifications techniques fournies dans une note de synthèse, puis à versionner le projet sur GitHub tout au long du développement.",
    "technologies": ["HTML", "CSS"],
    "link": "https://github.com/Alexmqs/Projet-2-OC-Booki",
    "intitule": "Scénario donné par OpenClassrooms",
    "problematique": "Le choix entre l'utilisation de Flexbox ou Grid pour assurer la réactivité du projet et en faciliter la manipulation."
  },
  {
    "id": 2,
    "title": "OC Kasa",
    "image": "/Assets/Kasa.png",
    "shortDescription": "Le projet Kasa permet aux utilisateurs de trouver des logements partout en France.",
    "fullDescription": " En tant que développeur front-end freelance, vous êtes chargé de participer à la refonte du site de Kasa, une entreprise leader dans la location d'appartements entre particuliers. Le site, actuellement en ASP.NET avec un code legacy, doit être entièrement refait avec une nouvelle stack JavaScript : Node.js pour le back-end (en cours de recrutement) et React pour le front-end. Vous devez démarrer l'application React en développant les composants, en suivant les maquettes Figma fournies par Paul, le designer, qui incluent des ressources exportables et des prototypes pour un rendu réaliste des animations et des interactions. Le développement doit intégrer des fonctionnalités spécifiques comme la gestion du défilement des images dans la galerie et les comportements des menus déroulants (Collapse). Vous utiliserez un fichier JSON contenant des annonces temporaires pour construire l'interface front-end en attendant l'arrivée du back-end. Tout en respectant les guidelines techniques de Kasa, vous aurez la liberté de choisir un bundler comme Vite si vous le souhaitez.",
    "technologies": ["React", "JavaScript"],
    "link": "https://github.com/Alexmqs/projet-5-kasa-master",
    "intitule": "Scénario donné par OpenClassrooms",
    "problematique": "Assurer que toutes les cartes aient une forme carrée et un aspect homogène."
  },
  {
    "id": 3,
    "title": "OC Architect",
    "image": "/Assets/Architect.png",
    "shortDescription": "Le projet Architect est une application web permettant de gérer des projets de construction.",
    "fullDescription": " En tant que développeur front-end chez ArchiWebos, une agence de 50 salariés, vous rejoignez une équipe travaillant sur la création d'un site portfolio pour une architecte d'intérieur. Ayant terminé votre dernier projet en avance, vous êtes affecté en renfort pour cette mission. Lors de votre premier brief, Charlotte, la cheffe de projet, vous partage le design du site via Figma, ainsi que le code back-end et front-end déjà en place, et un tableau Kanban pour suivre vos tâches. Vous devez développer trois éléments principaux : la page de présentation des travaux de l'architecte, la page de connexion pour l'administrateur, et une modale pour l'upload de nouveaux médias, les deux derniers à créer entièrement from scratch. Vous êtes désormais prêt à relever ce nouveau défi, en collaborant étroitement avec l'équipe et en utilisant les outils fournis.",
    "technologies": ["HTML", "CSS", "JavaScript"],
    "link": "https://github.com/Alexmqs/Projet-3-Portfolio-architecte-sophie-bluel-master",
    "intitule": "Scénario donné par OpenClassrooms",
    "problematique": "Apprendre à utiliser JavaScript pour gérer l'ajout et la suppression de projets sans avoir à réactualiser la page."
  },
  {
    "id": 4,
    "title": "OC MVG",
    "image": "/Assets/MVG.png",
    "shortDescription": "Le projet MVG est un site de gestion de voyages pour planifier des itinéraires et réserver des services.",
    "fullDescription": " En tant que développeur back-end freelance, vous collaborez avec Kévin, un développeur front-end expérimenté, pour créer le site de notation de livres 'Mon Vieux Grimoire' pour une chaîne de librairies. Kévin s'occupe du front-end en React, tandis que vous êtes chargé de développer l'API back-end. Le site permettra aux utilisateurs de référencer des livres et d'attribuer des notes visibles par le public. Après avoir consulté les spécifications fonctionnelles et techniques, vous devez implémenter une API qui gère l'ajout de livres, la gestion des notes et l'optimisation des images envoyées par les utilisateurs, afin de respecter les bonnes pratiques du Green Code. Vous travaillerez à partir des spécifications techniques et du front-end développé, en intégrant et testant l'ensemble avant de livrer le projet finalisé.",
    "technologies": ["React", "JavaScript", "API"],
    "link": "https://github.com/Alexmqs/P6-Web-livres-main",
    "intitule": "Scénario donné par OpenClassrooms",
    "problematique": "Mettre en place des mesures de sécurité lors de la connexion, en s'assurant que les mots de passe ne soient pas visibles ni stockés en clair dans le code."
  },
  {
    "id": 5,
    "title": "OC Nina",
    "image": "/Assets/Nina.png",
    "shortDescription": "Le projet Nina est une application mobile destinée à faciliter la gestion des tâches quotidiennes.",
    "fullDescription": " En tant que développeur web freelance spécialisé dans l'optimisation SEO, vous êtes en charge d'améliorer les performances et la visibilité du site de Nina Carducci, une photographe. Après avoir identifié des problèmes de performance, vous avez proposé une série d'optimisations, incluant la réduction du temps de chargement des pages via l'optimisation des images et du code, l'amélioration de l'accessibilité, et l'intégration du référencement local grâce à Schema.org. Vous allez également ajouter des metas pour les réseaux sociaux et résoudre quelques bugs présents dans la navigation de la galerie d'images. En plus de livrer un site optimisé, vous fournirez un rapport détaillé, comparant les performances avant et après intervention, ainsi qu'une liste des modifications apportées. Vous travaillerez en collaboration avec Nina, qui vous a fourni toutes les informations nécessaires pour cette mission, et vous mettrez à jour le code via GitHub.",
    "technologies": ["React", "JavaScript", "SEO"],
    "link": "https://github.com/Alexmqs/Projet-4-Nina-Carducci-Dev-master",
    "intitule": "Scénario donné par OpenClassrooms",
    "problematique": "Optimiser le code en supprimant les bibliothèques externes et en créant un carrousel uniquement avec du code natif."
  }
]
